[
    "Experienced HR Consultant with 5+ years of diverse HR experience across various organizational levels. Must demonstrate strong problem-solving abilities, business acumen, and analytical skills with proven expertise in consulting, facilitation, conflict resolution, and cultural agility. The ideal candidate possesses excellent communication skills (both verbal and written), is detail-oriented, organized, and capable of multitasking in fast-paced environments. Must be able to collaborate effectively within teams while also demonstrating leadership when necessary. Bachelor's degree in HR Management, Organizational Psychology, Business, or related field preferred. Experience with HR systems is advantageous. This consultant will engage in diverse HR areas including leadership strategies, talent development, performance management, employment relations, HRIS, and compensation. Roles may be remote, hybrid, or onsite depending on client needs. The successful candidate will be ready to inject excitement into their daily routine while delivering tailored solutions precisely when clients need them most.",
    
    "High-volume Contract-to-Perm Recruiter for a pharmaceutical company specializing in genetic and RNA-based medicines in Madison/Verona, WI. The ideal candidate has 3+ years of recruiting experience with proven success in high-volume roles, demonstrating expertise in pharmaceutical industry recruiting across general business, healthcare, and technical positions. Must manage the full recruitment lifecycle from job posting and candidate screening to interviewing and onboarding. Essential skills include exceptional candidate experience delivery, effective collaboration with hiring managers, and proficiency with applicant tracking systems. The successful candidate will develop and implement effective recruitment strategies, utilize various sourcing channels (job boards, social media, professional networks), and maintain accurate recruitment metrics. Strong communication and interpersonal skills are critical for engaging effectively with candidates and hiring managers. Bachelor's degree in Human Resources, Business, or related field preferred. This position offers $60/hour with potential for transition to a permanent role and comprehensive benefits package. Some travel may be required for industry events or candidate meetings.",
    
    "Mid-career Interim HR Business Partner with generalist background for a 3+ month assignment in Burbank, CA. The ideal candidate brings 5+ years of experience as an HR Business Partner or Generalist, preferably in retail, warehouse, or distribution environments, with demonstrated expertise in employee relations, organizational development, and compensation management. Must have strong federal/state compliance subject matter expertise and process improvement experience. This 1099 independent contractor role requires excellent consulting and problem-solving skills with the ability to navigate complex HR situations. The successful candidate will provide guidance to managers and employees on various HR matters, collaborate with management to meet business objectives, manage employee relations (including investigations), support organizational development initiatives, contribute to HR policy development, and maintain compliance with Federal and California labor laws. Must be available for onsite engagement during initial ramp-up, followed by a hybrid arrangement (up to 3 days/week onsite). Bachelor's degree in HR, Business Administration, or related field required. Pay rate is $45-$55/hour.",
    
    "Experienced Interim Total Rewards Leader for onsite position in Orange County, CA to oversee compensation and benefits administration during a critical period. The ideal candidate brings proven leadership experience in Total Rewards, preferably within mid to large-sized organizations, with deep expertise in UKG (Ultimate Kronos Group) software. Must demonstrate strong knowledge of compensation and benefits regulations, trends, and best practices, along with process improvement and system optimization experience. Essential responsibilities include managing day-to-day total rewards operations, leading a small team, developing and implementing aligned strategies, collaborating with senior leadership, ensuring regulatory compliance, leveraging UKG for program management, addressing employee inquiries, and monitoring industry trends. The successful candidate will possess excellent communication, problem-solving, and strategic thinking skills with demonstrated ability to manage teams and work collaboratively with leadership. This 1099 contract position requires the ability to balance operational execution with strategic planning while ensuring accurate administration of employee compensation and benefits. Must be able to work onsite in Orange County, CA and make an immediate impact.",
    
    "Seasoned Interim Payroll Manager with 5+ years of hands-on experience managing payroll operations, particularly using ADP systems. The ideal candidate possesses thorough understanding of federal, state, and local payroll laws and regulations, with experience in multi-state/multi-location companies. Bachelor's degree in Accounting, Finance, Business Administration, or related field preferred, along with professional certification such as CCP (Certified Payroll Professional). Must demonstrate strong analytical skills and meticulous attention to detail for precise payroll processing. Key responsibilities include overseeing accurate and timely payroll processing, managing reporting and tax filings, resolving discrepancies, collaborating with HR and finance departments, ensuring regulatory compliance, preparing management reports, and assisting with system implementations or updates. Experience processing equity payouts is a plus. The successful candidate will possess excellent communication skills and demonstrate ability to lead teams effectively. This 1099 contract position may be remote, hybrid, or onsite depending on client needs, with many clients based in Southern California. Must be ready to support clients on a project basis while maintaining efficiency and accuracy throughout scheduled payroll cycles.",
    
    "Versatile Contract Recruiter with 5+ years of recruiting experience for both long-term and short-term assignments. The ideal candidate demonstrates a proven track record of successful delivery against challenging time-to-fill targets, with exceptional organizational skills and ability to multi-task in fast-paced environments. Must possess excellent verbal and written communication skills, strong negotiation abilities, and experience managing multiple searches, projects, and client relationships simultaneously. Responsibilities may include partnering with HR leads and hiring teams to understand specific hiring needs, recommending and implementing new strategies and processes, managing requisitions, conducting full-cycle recruitment from job postings through the interview process, and sourcing passive candidates via advanced internet techniques. Strong consulting skills are essential, along with demonstrated ability to work in team environments as both leader and member. Knowledge of various applicant tracking systems is advantageous. Bachelor's degree or equivalent experience required. Location requirements depend on project and client needs – assignments may require onsite presence at client offices or may be fully remote. The successful candidate will thrive on diversity and seek their next great project opportunity.",
    
    "Technical Contract Recruiter with 5+ years of experience recruiting in the technology industry for a remote contract assignment lasting 6+ months. The ideal candidate has a proven track record of successful delivery against challenging time-to-fill targets specifically for IT and Engineering roles. Must be detail-oriented, highly organized, and able to multi-task in fast-paced environments while demonstrating strong verbal and written communication skills and negotiation abilities. Key responsibilities include partnering with HR leads, Talent Acquisition, and hiring teams to understand specific technical hiring needs, working within existing systems while recommending improvements, managing requisitions, conducting full-cycle recruitment, and building talent pools through advanced sourcing techniques. Experience managing multiple technical searches, projects, and client relationships simultaneously is essential. Must possess strong consulting skills and demonstrated ability to work effectively in team environments. Knowledge of various applicant tracking systems is required, with Workday experience being a plus. The successful candidate will excel at sourcing passive technical candidates and building specialized talent networks while working remotely for a high-tech company filling multiple technical positions.",
    
    "Strategic HR Project Manager with specific expertise in Workday HR module implementations. The ideal candidate brings proven experience managing end-to-end implementations of Workday HCM, including Core HR, Talent Management, Compensation, and Payroll modules. Must demonstrate excellent project management skills with a track record of delivering complex HR technology projects on time and within budget. Bachelor's degree in Human Resources, Business Administration, or related field required, with PMP, PMI-ACP, or similar certification being advantageous. Key responsibilities may include leading implementation projects, developing detailed plans with timelines and deliverables, coordinating with stakeholders and vendors, conducting status meetings, mitigating risks, ensuring data integrity during migration, providing training, and maintaining comprehensive documentation. The successful candidate will be a strategic thinker with exceptional communication and interpersonal skills, able to work independently while managing multiple priorities in fast-paced environments. Experience managing projects in a consulting capacity, preferably on a 1099 basis, is highly desirable. This 1099 contract position requires collaboration with clients to ensure seamless transitions from legacy systems to Workday, with the ability to lead cross-functional teams effectively.",
    
    "Experienced Interim Benefits Leader for onsite position in Orange County, CA to oversee benefits function during a critical period. The ideal candidate brings proven leadership experience in a Benefits role, preferably within a mid to large-sized organization, with expertise in UKG (Ultimate Kronos Group) software. Must possess strong knowledge of benefits regulations, trends, and best practices, along with process improvement and system optimization experience. Essential responsibilities include managing day-to-day benefits operations, leading a small team, developing and implementing aligned strategies, collaborating with senior leadership, ensuring regulatory compliance, leveraging UKG for program management, addressing employee inquiries promptly, and monitoring industry trends for program enhancements. The successful candidate will demonstrate ability to manage teams effectively while working collaboratively with senior leadership. Must possess excellent communication, problem-solving, and strategic thinking skills. This 1099 contract position is ideal for professionals with deep expertise in benefits management and strategy who are ready to make an immediate impact. Must be comfortable working onsite in Orange County, CA, legally authorized to work in the United States without sponsorship, and have minimum 5 years experience in Benefits Administration and 4 years in Benefits Management."
]